package sample;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.List;

public class DataList {
    static public String [][]textList={
            {"请选择我左手边的两个物体中靠下的物体", "请选择你左手边的两个物体中靠上的物体",
                    "请选择离我最近的两个物体中靠下的物体", "请选择离你最近的两个物体中靠上的物体",
                    "把右手伸到桌子上方，选择右侧靠下的物体","你的左手边有两个物体，请选择靠上的物体",
                    "在离你最远的两个物体中，选择靠下的物体","在离我最远的两个物体中，选择靠上的物体",
                    "我的左手边有两个物体，请选择靠下的物体","请选择你右手边的两个物体中靠下的物体",
                    "请选择我右手边的两个物体中靠上的物体","把左手伸到桌子上方，选择左侧靠上的物体",
                    "在离我最近的两个物体中，选择靠下的物体","请选择离你最远的两个物体中靠下的物体",
                    "请选择离我最远的两个物体中靠上的物体","在离你最近的两个物体中，选择靠上的物体",
                    "你的右手边有两个物体，请选择靠下的物体","我的右手边有两个物体，请选择靠上的物体",
                    "把右手伸到桌子上方，选择远处靠下的物体","把左手伸到桌子上方，选择近处靠上的物体"},
            {"请选择在我看来位于大物块前面的小物体", "请选择在你看来位于大物块后面的小物体",
                    "请选择在你看来位于大物块右边的小物体", "请选择在我看来位于大物块右边的小物体",
                    "在你看来，请选择位于大物块前面的小物体","在我看来，请选择位于大物块后面的小物体",
                    "左手抬起向前伸，选择大物块前面的小物体","在你看来，请选择位于大物块右边的小物体",
                    "在我看来，请选择位于大物块右边的小物体","请选择在我看来位于大物块后面的小物体",
                    "请选择在你看来位于大物块前面的小物体","请选择在我看来位于大物块左边的小物体",
                    "请选择在你看来位于大物块左边的小物体","在你看来，请选择位于大物块后面的小物体",
                    "在我看来，请选择位于大物块前面的小物体","右手抬起向前伸，选择大物块后面的小物体",
                    "在我看来，请选择位于大物块左边的小物体","右手抬起向前伸，选择大物块右边的小物体",
                    "在你看来，请选择位于大物块左边的小物体","左手抬起向前伸，选择大物块左边的小物体"},
            {"请选择与彩色物块的距离相对较远的物体","请选择在你看来位于彩色物块右边的物体",
                    "请选择在我看来位于彩色物块右边的物体","右手抬起向前伸，选择彩色物块右边的物体",
                    "在你看来，请选择位于彩色物块右边的物体","桌面上有个彩色物块，选择离它较近的物体",
                    "在我看来，请选择位于彩色物块右边的物体","请选择在我看来位于彩色物块左边的物体",
                    "请选择与彩色物块的距离相对较近的物体","请选择在你看来位于彩色物块左边的物体",
                    "在我看来，请选择位于彩色物块左边的物体","桌面上有个彩色物块，选择离它较远的物体",
                    "左手抬起向前伸，选择彩色物块左边的物体","在你看来，请选择位于彩色物块左边的物体"},
            {"请选择在我看来位于彩色物块右边且离我较近的物体","请选择在我看来位于彩色物块右边且相对靠后的物体",
                    "请选择在你看来位于彩色物块左边且相对靠后的物体","请选择在你看来位于彩色物块左边且离你较近的物体" ,
                    "请选择在你看来位于彩色物块右边且相对靠上的物体","请选择在我看来位于彩色物块左边且相对靠下的物体",
                    "在你看来，彩色物体左边有两个物体，选择离你远的物体","右手抬起向前伸，请选择彩色物体左边、相对靠前的物体",
                    "在你看来，彩色物体左边有两个物体，选择最靠后的物体","左手抬起向前伸，请选择彩色物体左边、相对靠后的物体",
                    "在我看来，彩色物体左边有两个物体，选择最靠上的物体","在你看来，彩色物体右边有两个物体，选择最靠下的物体",
                    "在我看来，彩色物体右边有两个物体，选择最靠后的物体","请选择在你看来位于彩色物块左边且相对靠前的物体",
                    "请选择在我看来位于彩色物块右边且相对靠前的物体","左手抬起向前伸，请选择彩色物体右边、相对靠上的物体",
                    "在你看来，彩色物体左边有两个物体，选择最靠前的物体","左手抬起向前伸，请选择彩色物体左边、离你较远的物体",
                    "在我看来，彩色物体右边有两个物体，选择离我远的物体","在我看来，彩色物体右边有两个物体，选择最靠前的物体"},
            {"请选择在我看来从中间的彩色物体往左数第二个物体","请选择与彩色物体同行且与它的距离相对较远的物体",
                    "请选择在你看来从中间的彩色物体往右数第一个物体","请选择与彩色物体同行且与它的距离相对较近的物体",
                    "请选择在我看来从中间的彩色物体往右数第一个物体","请选择与彩色物体不同行且与它的距离比较近的物体",
                    "请选择在我看来从中间的彩色物体往右数第二个物体","在你看来，彩色物体右边有两个物体，选择靠右侧的物体",
                    "在与彩色物体同行的物体中，选择与它距离较远的物体","在我看来，彩色物体左边有两个物体，选择靠右侧的物体",
                    "左手抬起向前伸，请选择彩色物体右边、相对靠左的物体","在你看来，彩色物体左边有两个物体，选择离你近的物体",
                    "右手抬起向前伸，请选择彩色物体左边、离你较近的物体","在我看来，彩色物体右边有两个物体，选择离我近的物体",
                    "在与彩色物体不同行的物体中，选择距离它较远的物体","请选择在你看来从中间的彩色物体往右数第二个物体",
                    "请选择在我看来从中间的彩色物体往左数第一个物体","请选择在你看来从中间的彩色物体往左数第一个物体",
                    "请选择在你看来从中间的彩色物体往左数第二个物体","请选择与彩色物体不同行且与它的距离比较远的物体",
                    "在我看来，彩色物体左边有两个物体，选择靠左侧的物体","右手抬起向前伸，请选择彩色物体右边、相对靠右的物体",
                    "在你看来，彩色物体右边有两个物体，选择靠左侧的物体","在与彩色物体同行的物体中，选择与它距离较近的物体",
                    "在我看来，彩色物体右边有两个物体，选择离我远的物体","在与彩色物体不同行的物体中，选择距离它较近的物体",
                    "在你看来，彩色物体左边有两个物体，选择离你远的物体","左手抬起向前伸，请选择彩色物体左边、离你较远的物体"},
            {"请选择在你看来位于小车左边的物体","请选择在你看来位于小车右边的物体",
                    "请选择小车的车尾方向正对着的物体","请选择在你看来位于小车后面且离你较远的物体",
                    "靠近小车左侧车门的物体中，选择离你较远的物体","请选择在我看来位于小车后面且离我较远的物体",
                    "请选择靠近小车左侧车门方向且离它较远的物体","在我看来，请选择位于小车右边的物体",
                    "抬起左手，请选择位于小车左边的物体","在你看来，请选择位于小车右边的物体",
                    "靠近小车左侧车门的物体中，选择离你较近的物体","在我看来，位于小车后面，选择这个离我较远的物体",
                    "请选择在我看来位于小车右边的物体","请选择小车的车头方向正对着的物体",
                    "请选择在我看来位于小车左边的物体","在我看来，请选择位于小车左边的物体",
                    "请选择在我看来位于小车前面且离我较近的物体","在你看来，位于小车前面，选择这个离你较远的物体",
                    "请选择在你看来位于小车前面且离你较近的物体","在你看来，请选择位于小车左边的物体",
                    "找到小车的车头，选择它正对着的物体","抬起右手，请选择位于小车右边的物体",
                    "找到小车的车尾，选择它正对着的物体","在我看来，位于小车前面，选择这个离我较近的物体",
                    "抬起左手，选择位于小车前面、与你距离较远的物体","在你看来，位于小车后面，选择这个离你较近的物体",
                    "抬起右手，选择位于小车后面、与你距离较近的物体"},
            {"请选择在我看来从中间的小车往右数第一个物体","请选择小车车头方向且与它的距离比较近的物体",
                    "请选择在你看来从中间的小车往左数第二个物体","请选择小车车头方向且与它的距离比较远的物体",
                    "请选择在我看来从中间的小车往左数第一个物体","请选择在我看来从中间的小车往左数第二个物体",
                    "在小车车头方向的物体中，选择距离它较近的物体","在我看来，小车右边有两个物体，选择离我近的物体",
                    "在我看来，小车左边有两个物体，选择靠右侧的物体","左手抬起向前伸，请选择小车右边、相对靠左的物体",
                    "在我看来，小车左边有两个物体，选择靠左侧的物体","在小车车尾方向的物体中，选择距离它较远的物体",
                    "请选择在你看来从中间的小车往左数第一个物体","右手抬起向前伸，请选择小车左边、离你较近的物体",
                    "请选择在我看来从中间的小车往右数第二个物体","在你看来，小车左边有两个物体，选择离你远的物体",
                    "请选择在你看来从中间的小车往右数第一个物体","请选择小车车尾方向且与它的距离比较近的物体",
                    "请选择在你看来从中间的小车往右数第二个物体","请选择小车车尾方向且与它的距离比较远的物体",
                    "在我看来，小车右边有两个物体，选择离我远的物体","在你看来，小车左边有两个物体，选择离你近的物体",
                    "左手抬起向前伸，请选择小车左边、离你较远的物体","在小车车头方向的物体中，选择距离它较远的物体",
                    "在你看来，小车右边有两个物体，选择靠左侧的物体","在小车车尾方向的物体中，选择距离它较近的物体",
                    "在你看来，小车右边有两个物体，选择靠右侧的物体","右手抬起向前伸，请选择小车右边、相对靠右的物体"},
            {"请选择在我看来位于小车右边且靠上的物体","请选择在你看来位于小车左边且靠下的物体",
                    "请选择在你看来位于小车右边且靠上的物体","请选择在我看来位于小车左边且靠下的物体",
                    "请选择在你看来位于小车后面且靠上的物体","请选择正对小车左侧车门方向且靠上的物体",
                    "请选择在我看来位于小车后面且靠下的物体","在你看来，小车左边的物体中，选择靠上的物体",
                    "在我看来，小车右边的物体中，选择靠下的物体","正对小车车尾方向的物体中，选择靠上的物体",
                    "在你看来，小车右边的物体中，选择靠下的物体","在我看来，小车后面的物体中，选择靠上的物体",
                    "在你看来，小车后面的物体中，选择靠下的物体","正对小车左侧车门的物体中，选择靠下的物体",
                    "请选择正对着小车的车头方向且靠上的物体","正对小车车头方向的物体中，选择靠下的物体",
                    "在我看来，小车左边的物体中，选择靠上的物体","请选择正对着小车的车尾方向且靠下的物体",
                    "请选择在我看来位于小车前面且靠上的物体","请选择在你看来位于小车前面且靠下的物体",
                    "在你看来，小车前面的物体中，选择靠上的物体","在我看来，小车前面的物体中，选择靠下的物体"},
    };
    static public int [][]rightPlace={
            {4,1,2,3,4,1,2,3,4,4,1,1,2,2,3,3,4,1,2,3},
            {2,2,3,1,2,2,2,3,1,2,2,3,1,2,2,2,3,3,1,1},
            {2,2,1,2,2,1,1,2,1,1,2,2,1,1},
            {1,1,2,2,3,4,1,1,2,2,3,4,1,1,2,3,1,1,2,2},
            {4,4,3,3,2,2,1,4,4,3,3,2,2,1,1,4,3,2,1,1,4,4,3,3,2,2,1,1},
            {1,4,4,2,2,3,3,1,1,4,2,3,1,1,4,4,2,2,3,1,1,4,4,2,2,3,3},
            {2,2,1,1,3,4,2,1,3,3,4,4,2,2,1,1,3,3,4,4,2,2,1,1,3,3,4,4},
            {1,2,5,6,3,3,4,1,2,5,6,3,4,4,1,2,5,6,3,4,3,4},
    };

    static public String []testCmd={"请选择离我最近的物体","请选择离你最远的物体","请选择离我最远的物体","请选择离你最近的物体",
            "请选择我最左边的物体","请选择你最右边的物体","请选择我最右边的物体","请选择你最左边的物体"};
    static public int []rightTest={3,3,4,4,4,4,1,1};

    static Integer []randList={
            100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,
            200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,
            300,301,302,303,304,305,306,307,308,309,310,311,312,313,
            400,401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,
            500,501,502,503,504,505,506,507,508,509,510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,
            600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,619,620,621,622,623,624,625,626,
            700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,
            800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,815,816,817,818,819,820,821
    };

    static Integer[] preList={0,1,2,3,4,5,6,7};

    static int index = -1;
    static int preIndex = -1;
    static int preRightAns = 0;
    static int rightAns = 0;

    static public List<Integer> getRandList (){
        List<Integer> list = new ArrayList<>(Arrays.asList(randList));
        Collections.shuffle(list);
        return list;
    }

    static public List<Integer> preGetRandList (){
        List<Integer> list = new ArrayList<>(Arrays.asList(preList));
        Collections.shuffle(list);
        return list;
    }

    static public int getRightAns(){
        return rightAns;
    }

    static public int preGetRightAns(){return  preRightAns;}

    static void setRightAns(int i){
        rightAns = rightPlace[i/100-1][i%100];
    }

    static void preSetRightAns(int i){
        preRightAns = rightTest[i];
    }

    static public int getNext(List<Integer> list){
        index++;
        if(index>=list.size()) return -1;
        return list.get(index);
    }

    static public int preGetNext(List<Integer> list){
        preIndex++;
        if(preIndex>=list.size()) return -1;
        return list.get(preIndex);
    }
}
